Revit 2027 API
SiteSubRegion Methods
The SiteSubRegion type exposes the following members.
Methods
Name | Description
Create(Document, IList<CurveLoop>) | Obsolete.
 Creates a new SiteSubRegion element and adds it to the document.
Create(Document, IList<CurveLoop>, ElementId) | Obsolete.
 Creates a new SiteSubRegion element with assigned TopographySurface to be hosted and adds it to the document.
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundary |  Gets the boundary of current subregion.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsValidBoundary |  Identifies whether the given curve loops compose a valid boundary.
SetBoundary | Obsolete.
 Set the given curve loops as the boundary of an existing SiteSubRegion.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
SiteSubRegion Class
Autodesk.Revit.DB.Architecture Namespace